const products = [
  {
    id: '1',
    title: 'Html',
    mainText: 'html از تگ های متنوعی تشکیل شده است که بدنه اصلی سایت را میسازد',

    description: `زبان نشانه‌گذاری ابرمتنی، یا زنگام  در کنار سی‌اس‌اس هستهٔ فناوری ساخت صفحه‌های وب هستند. HTML زبان توصیف ساختار صفحه‌های وب است. زبانی است برای نشانه‌گذاری ابرمتن  که برای تدوین قالب و طراحی صفحه‌های وب به کار می‌برند. دستورالعمل‌های این زبان، برچسب  نام دارند که محتوای یک صفحهٔ وب با آن‌ها، نشانه‌گذاری شده و بدین‌ترتیب، نحوهٔ نمایش آن صفحه برای مرورگرهای وب، توصیف می‌شود. و تاکنون ۵ نسخه از اچ‌تی‌ام‌ال عرضه شده‌است.

    هر یک از برچسب‌های اچ‌تی‌ام‌ال، معنا و مفهوم خاصی دارند و تأثیر مشخصی بر محتوا می‌گذارند؛ مثلاً برچسب‌هایی برای تغییر شکل ظاهری متن، نظیر درشت و ضخیم کردن یک کلمه یا برقراری پیوند به صفحات دیگر در اچ‌تی‌ام‌ال تعریف شده‌اند.
    
    یک سند اچ‌تی‌ام‌ال، یک پروندهٔ مبتنی بر متن  است که معمولاً با پسوند .htmL یا .htmL نام‌گذاری شده و محتویات آن از برچسب‌های اچ‌تی‌ام‌ال تشکیل می‌شود. مرورگرهای وب، که قادر به درک و تفسیر برچسب‌های اچ‌تی‌ام‌ال هستند، تک‌تک آن‌ها را از داخل سند اچ‌تی‌ام‌ال خوانده و سپس محتوای آن صفحه را نمایان‌سازی  می‌کنند.
    
    اچ‌تی‌ام‌ال زبان برنامه‌نویسی نیست، بلکه زبانی برای نشانه‌گذاری ابرمتن است و اساساً برای ساختارمند کردن اطلاعات و جدایش اجزای منطقی یک نوشتار  به کار می‌رود. از سوی دیگر، اچ‌تی‌ام‌ال را نباید به عنوان زبانی برای صفحه‌آرایی یا نقاشی صفحات وب به کار بُرد؛ این وظیفه اکنون بر دوش فناوری‌های دیگری همچون سی‌اس‌اس است.
    
    گفتنی است اچ‌تی‌ام‌ال شکلی از زبان دیگری به نام اس‌جی‌ام‌ال است و کنسرسیوم وب آن را به عنوان استانداردی برای نشانه‌گذاری مستندات ابرمتنی برای عرضه در وب، تدوین کرده‌است. `,
    

    image: '/images/html.jpg',
  },
  {
    id: '2',
    title: 'Css',
    mainText: 'css استایل سایت را میسازد و ظاهر سایت را بوجود می آورد',

    description: `شیوه‌نامه آبشاری  با کوته‌نوشت سی‌اس‌اس  یک زبان برای ساخت شیوه‌نامه است که از آن برای توصیف نمایش یک سند  استفاده می‌شود.[۱] سی‌اس‌اس یکی از فناوری‌های بنیادین  در وب جهان‌گستر است.[۲]

    سی‌اس‌اس روشی ساده برای نمایش چیدمان و جلوه‌های تصویری بر صفحه‌های وب است.[۳] سی‌اس‌اس از جنس زبان‌های نشانه‌گذاری، با ساختار متن سادهٔ رایانه هستند و درون هرکدام، دستورهایی آبشار مانند و پی‌درپی، برای چگونگی نمایش هر صفحه وب افزوده می‌شود. به گفته‌ای ساده‌تر، این دستورها روش نشان داده شدن قلم‌ها و اندازه‌شان، رنگ‌ها و پس زمینه‌ها، روش چیدمان موزاییک‌های دربرگیرنده داده‌ها ، و بسیاری دیگر از عنصرهای ساختار هر صفحه وب را، درون خود جای می‌دهند.
    
    بیشترین استفاده‌ای که از این زبان در حال حاضر می‌شود مشخص کردن سبک صفحهٔ وب اچ‌تی‌ام‌ال و اکس‌اچ‌تی‌ام‌ال است ولی آن را می‌توان بر هر نوع مستند اکس‌ام‌ال از جمله اس‌وی‌جی و اکس‌یوال اعمال کرد. نگهداری و تغییر مشخصات سی‌اس‌اس به عهدهٔ کنسرسیوم وب جهانگستر است. `,
   

    image: '/images/html.jpg',
  },
  {
    id: '3',
    title: 'javaScript',
    mainText: 'javaScript عملکرد مورد نیاز درون سایت را مدیریت می کند ',

    description:` جاوااسکریپت: JavaScript،  با کوته‌نوشت JS نوعی زبان برنامه‌نویسی است که با ویژگی‌های ارائه شده در مشخصات اکما اسکریپت مطابق است.[۹] جاوااسکریپت نوعی زبان سطح بالا، کامپایل درجا و چندالگویی است. جاوااسکریپت نحو آکولادی دارد، نوع‌دهی آن پویا است، نوع شیءگرا‌ی‌اش بر پایه پیش‌نمونه است و دارای توابع کلاس اول است.[۱۰]

    در کنار HTML و CSS، جاوااسکریپت یکی از فن‌آوری‌های هسته‌ای وب جهان‌گستر است.[۱۱]
    
    علیرغم اشتباه عمومی، زبان جاوااسکریپت با زبان جاوا ارتباطی ندارد، دلیل این نام‌گذاری محبوبیت زبان جاوا در هنگام تولد جاوااسکریپت بود؛ اگر چه ساختار این زبان به سی پلاس پلاس (++C) و سی شارپ (C#) شباهت دارد که این امر برای یادگیری آسان در نظر گرفته شده‌است. از همین رو دستورهای متداول مانند if, for, try..catch, while و … در این زبان هم یافت می‌گردند.
    
    این زبان می‌تواند هم به صورت ساخت یافته و هم به صورت شی گرا مورد استفاده قرار گیرد. در این زبان اشیاء با اضافه شدن متدها و خصوصیات پویا به اشیاء خالی ساخته می‌شوند، برخلاف جاوا. بعد از ساخته شدن یک شی به روش فوق، این شی می‌تواند به عنوان نمونه‌ای برای ساخته شدن اشیاء مشابه مورد استفاده قرار گیرد.
    
    به علت این قابلیت زبان جاوااسکریپت برای ساختن نمونه از سیستم، مناسب است.
    
    کاربرد گسترده این زبان در سایت‌ها و صفحات اینترنتی بوده و به کمک این زبان می‌توان به اشیاء داخل صفحات اچ‌تی‌ام‌ال دسترسی پیدا کرد و آن‌ها را تغییر داد. به همین علت برای پویانمایی در سمت کاربر، از این زبان استفاده می‌شود. `,
  

    image: '/images/javascript.png',
  },
  {
    id: '4',
    title: 'React',
    mainText: 'React یک framWork است که برای javaScript ساخته شده است ',

    description: `ری‌اکت ، یک کتابخانه[۲] متن‌باز جاوا اسکریپت برای ساخت رابط‌های کاربری و اجزای(Component) صفحات وب است. ری‌اکت در دو نسخه ری‌اکت جی اس (به انگلیسی: React.js) و ری‌اکت نیتیو (به انگلیسی: React Native) ارائه شده‌است. ری‌اکت جی اس برای دسکتاپ و ری‌اکت نیتیو برای طراحی برنامه‌های موبایل می‌باشد. از دیگر کتابخانه‌های مشابه می‌توان به Angular و Vue اشاره کرد. این کتابخانه‌های جاوااسکرپت با هدف ساختن صفحات وب در صفحه مرورگر مقصد به جای ساخته شدن صفحات در سمت سرور تولید شده‌اند. بدین مفهوم که پس از ارتباط اولیه کلاینت با سرور، ابتدا این کتابخانه‌ها بر روی کلاینت بارگزاری می‌شوند و سپس از طریق ارتباط با API محتوای متغیر درون صفحه به صورت جداگانه بارگیری شده و صفحه وب در سمت مقصد سرهم می‌شود.

    درست شدن صفحات وب در سمت مقصد با این روش این امکان را فراهم می‌کند که بتوان برنامه‌هایی با سرعت بالا و پر قدرت برای صفحات نوشت که در گذشته امکان‌پذیر نبود.
    
    این کتابخانه توسط فیس‌بوک و جامعه‌ای از توسعه‌دهندگان و شرکت‌ها به صورت انفرادی توسعه و نگه‌داری می‌شوند.[۳] براساس آنالیزهای جاوااسکریپت سرویس لیبسکور، ری‌اکت در حال حاضر در سایت‌های نت‌فلیکس، ایمجر، بلیچر رپورت، فیدلی، ایر بی‌ان‌بی و … مورد استفاده قرار می‌گیرد.
    
    به دلیل بهینه بودن ری‌اکت برای دریافت اطلاعاتی که با سرعت تغییر می‌کنند، می‌توان از آن برای توسعه برنامه تک‌صفحه‌ای(SPA) یا برنامه‌های موبایل استفاده کرد. هرچند دریافت اطلاعات، ابتدایی‌ترین بخش در یک صفحهٔ وب است و برنامه‌های پیچیده ری‌اکت معمولاً به کتابخانه‌های اضافه‌ای برای مدیریت وضعیت (به انگلیسی: State Management) , مسیریابی (URL mapping)، و اتصال به رابط برنامه‌نویسی کاربردی (API) نیاز دارند.
    
    ری‌اکت و ری‌اکت نیتیو از جمله پروژه‌های متن‌باز شرکت فیس‌بوک هستند که در صدر محبوب‌ترین پروژه‌های وبگاه گیت‌هاب قرار دارند.[۴]
    
    ری اکت (reactjs) اساساً یک کتابخانه open-source جاوا اسکریپتی برای ساخت رابط کاربری(user interfaces) برای single page applications(اپلیکیشن‌های تک‌صفحه‌ای) است. این کتابخانه برای مدیریت لایه View برای وب استفاده می‌شود. همچنین React این امکان رو در اختیار ما می‌گذارد که reusable UI components(کامپوننت‌های قابل استفاده مجدد رابط کاربری) را ایجاد کنیم.React در ابتدا توسط Jordan Walke یکی از مهندسین ارشد فیسبوک ایجاد شد.React ابتدا در سال ۲۰۱۱ در فیسبوک مورد استفاده قرار گرفت و سپس در سال ۲۰۱۲ در اینستاگرام استفاده شد.
    
    ری اکت این امکان را در اختیار توسعه دهندگان می‌گذارد که وب اپلیکیشن‌های بسیار بزرگ که می‌تواند date را تغییر بدهد، بدون reload صفحه ایجاد کنند. مهم‌ترین اهداف React را می‌توان سادگی، سرعت و مقیاس‌پذیر بودن دانست. تمرکز اصلی React بر روی رابط کاربری است و فقط در لایه View در معماری MVC مطابقت دارد. این کتابخانه می‌تواند با کتابخانه‌های و فریمورک‌های دیگر جاوا اسکریپت مثل Angular ترکیب و مورد استفاده قرار گیرد. `,


    image: '/images/react.jpg',
  },
]

export default products
